app/controllers/stories_controller.rb

SELECT * FROM "stories"
---
  def index
    @stories = Story.all

SELECT * FROM "stories" WHERE ("stories"."id" = 1)
---
  def show
    @story = Story.find(params[:id])

SELECT * FROM "stories" WHERE ("stories"."id" = 1)
---
  def edit
    @story = Story.find(params[:id])

INSERT INTO "stories" ("created_at", "title", "updated_at", "description") VALUES('2009-07-26 22:20:29', '', '2009-07-26 22:20:29', '')
---
  def create
    @story = Story.new(params[:story])

    respond_to do |format|
      if @story.save

SELECT * FROM "stories" WHERE ("stories"."id" = 1)
UPDATE "stories" SET "updated_at" = '2009-07-26 22:21:40', "title" = 'fasf', "description" = 'fdsafa' WHERE "id" = 1
---
  def update
    @story = Story.find(params[:id])

    respond_to do |format|
      if @story.update_attributes(params[:story])

SELECT * FROM "stories" WHERE ("stories"."id" = 2)
DELETE FROM "stories" WHERE "id" = 2
---
  def destroy
    @story = Story.find(params[:id])
    @story.destroy