app/controllers/tasks_controller.rb

SELECT * FROM "tasks" WHERE ("tasks"."story_id" = '--- :story_id
---
  def index
    p 'aaaa', params[:story_id]
    @tasks = Task.find_by_story_id(params[:story_id])

SELECT * FROM "tasks" WHERE ("tasks"."id" = 1)
---
  def show
    @task = Task.find(params[:id])

INSERT INTO "tasks" ("created_at", "updated_at", "story_id", "description") VALUES('2009-07-27 01:10:12', '2009-07-27 01:10:12', 0, 'sdfs')
---
  def create
    @task = Task.new(params[:task])

    respond_to do |format|
      if @task.save